app/views/topics/index.html.erb

SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."topic_id" = ?  [["topic_id", 1]]
---
        <br />
        <% topic.bookmarks.sample(4).each do |bookmark| %>