app/views/topics/show.html.erb

SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."topic_id" = ?  [["topic_id", 1]]
---

  <% @topic.bookmarks.each do |bookmark| %>