app/controllers/bookmarks_controller.rb

INSERT INTO "bookmarks" ("url", "topic_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["url", "https://repl.it/languages/ruby"], ["topic_id", 8], ["created_at", "2017-08-21 02:27:35.836429"], ["updated_at", "2017-08-21 02:27:35.836429"]]
---
  def create
    @bookmark = @topic.bookmarks.build(params.require(:bookmark).permit(:url))

    if @bookmark.save

UPDATE "bookmarks" SET "url" = ?, "updated_at" = ? WHERE "bookmarks"."id" = ?  [["url", "repl.poop/languages/ruby"], ["updated_at", "2017-08-21 03:37:37.424146"], ["id", 54]]
---
  def update

    @bookmark.assign_attributes(params.require(:bookmark).permit(:url))

    if @bookmark.save

DELETE FROM "bookmarks" WHERE "bookmarks"."id" = ?  [["id", 61]]
---
  def destroy

    if @bookmark.destroy

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 11]]
---
  def set_topic
    @topic = Topic.find(params[:topic_id])

SELECT  "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."id" = ? LIMIT 1  [["id", 61]]
---
  def set_bookmark
    @bookmark = Bookmark.find(params[:id])