app/controllers/topics_controller.rb

  def create
    @topic = Topic.new(topic_params)

    if @topic.save
---
INSERT INTO "topics" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "New topic"], ["created_at", "2017-08-19 03:55:52.383695"], ["updated_at", "2017-08-19 03:55:52.383695"]]

  def destroy

    if @topic.destroy
---
DELETE FROM "topics" WHERE "topics"."id" = ?  [["id", 7]]